os-python.yaml
config:
  target: "http://python.os.sttrcancer.io"
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 120
      arrivalRate: 5
      rampTo: 50
    - duration: 600
      arrivalRate: 50
  # payload:
  #   path: "keywords.csv"
  #   fields:
  #     - "keywords"
scenarios:
  - name: "One_user"
    flow:
      - post:
          url: "/py"
          json:
            method: "{{ cluster_sk_pca_incremental }}"
            n_components: "{{ 3 }}"
            data: "{{ [xxx]}}"
            whiten: "{{ false }}"
          # capture:
          #   json: "$."
          #   as: "id"
      # - get:
      #     url: "/details/{{ id }}"
      # - think: 3
      # - post:
      #     url: "/cart"
      #     json:
      #       productId: "{{ id }}"